app/views/stocks/_form.html.haml

SELECT `variants`.* FROM `variants`
---
    = f.label :variant_id
    = f.select :variant_id, options_from_collection_for_select(Variant.all, :id, :name, @stock.variant_id), {include_blank: true},class: 'form-control'
  .form-group