app/views/variants/_form.html.haml

SELECT `products`.* FROM `products`
---
    = f.label :product_id
    = f.select :product_id, options_from_collection_for_select(Product.all, :id, :name, @variant.product_id), {include_blank: true}, class: 'form-control'
  .form-group