app/controllers/categories_controller.rb

  def index
    @search = Category.search(params[:q])
---
SELECT `categories`.* FROM `categories`

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`created_at`, `lft`, `name`, `parent_id`, `rgt`, `updated_at`) VALUES ('2014-08-12 01:08:54', 7, 'C 4', 2, 8, '2014-08-12 01:08:54')

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE `categories` SET `lft` = CASE WHEN `lft` BETWEEN 2 AND 2 THEN `lft` + 4 - 2 WHEN `lft` BETWEEN 3 AND 4 THEN `lft` + 2 - 3 ELSE `lft` END, `rgt` = CASE WHEN `rgt` BETWEEN 2 AND 2 THEN `rgt` + 4 - 2 WHEN `rgt` BETWEEN 3 AND 4 THEN `rgt` + 2 - 3 ELSE `rgt` END, `parent_id` = CASE WHEN `id` = 2 THEN 1 ELSE `parent_id` END, updated_at = '2014-08-12 00:46:18' WHERE ((`categories`.`lft` BETWEEN 2 AND 4 OR `categories`.`rgt` BETWEEN 2 AND 4)) ORDER BY `categories`.`lft`

    def set_category
      @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories`  WHERE `categories`.`id` = 2 LIMIT 1 FOR UPDATE