app/controllers/products_controller.rb

SELECT `products`.* FROM `products`
---
  def index
    @search = Product.search(params[:q])

INSERT INTO `products` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2014-08-12 10:22:16', 'Nothing for now', 'Product 1', '2014-08-12 10:22:16')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save