app/controllers/stocks_controller.rb

  def index
    @search = Stock.search(params[:q])
---
SELECT `stocks`.* FROM `stocks`

  def create
    @stock = Stock.new(stock_params)

    respond_to do |format|
      if @stock.save
---
INSERT INTO `stocks` (`created_at`, `date`, `quantity`, `updated_at`) VALUES ('2014-08-12 17:20:32', '2014-08-12', 10, '2014-08-12 17:20:32')

  def update
    respond_to do |format|
      if @stock.update(stock_params)
---
UPDATE `stocks` SET `updated_at` = '2014-08-12 17:22:49', `variant_id` = 3 WHERE `stocks`.`id` = 1

    def set_stock
      @stock = Stock.find(params[:id])
---
SELECT  `stocks`.* FROM `stocks`  WHERE `stocks`.`id` = 1 LIMIT 1