app/controllers/stock_transfers_controller.rb

  def index
    @search = StockTransfer.search(params[:q])
---
SELECT `stock_transfers`.* FROM `stock_transfers`

  def create
    @stock_transfer = StockTransfer.new(stock_transfer_params)

    respond_to do |format|
      if @stock_transfer.save
---
INSERT INTO `stock_transfers` (`created_at`, `date`, `quantity`, `source_id`, `updated_at`, `variant_id`) VALUES ('2014-08-12 19:59:16', '2014-08-12', 10, 3, '2014-08-12 19:59:16', 3)

    def set_stock_transfer
      @stock_transfer = StockTransfer.find(params[:id])
---
SELECT  `stock_transfers`.* FROM `stock_transfers`  WHERE `stock_transfers`.`id` = 1 LIMIT 1