app/controllers/variants_controller.rb

SELECT `variants`.* FROM `variants`
---
  def index
    @variants = Variant.all

INSERT INTO `variants` (`cost_price`, `created_at`, `depth`, `height`, `price`, `product_id`, `updated_at`, `weight`, `width`) VALUES (5, '2014-08-12 13:38:39', 1, 1, 10, 1, '2014-08-12 13:38:39', 12, 1)
---
  def create
    @variant = Variant.new(variant_params)

    respond_to do |format|
      if @variant.save

UPDATE `variants` SET `depth` = 3, `height` = 2, `updated_at` = '2014-08-12 17:18:42' WHERE `variants`.`id` = 4
---
  def update
    respond_to do |format|
      if @variant.update(variant_params)

DELETE FROM `variants` WHERE `variants`.`id` = 1
---
  def destroy
    @variant.destroy

SELECT  `variants`.* FROM `variants`  WHERE `variants`.`id` = 4 LIMIT 1
---
    def set_variant
      @variant = Variant.find(params[:id])